[rocks]

[plugins]
"rocks.nvim" = "2.40.0"
"rocks-git.nvim" = "2.2.0"
"rocks-config.nvim" = "2.2.0"
"rocks-lazy.nvim" = "1.0.1"
"rocks-dev.nvim" = "1.7.0"

# +----------------------------------------------------------+
# | Colorschemes                                             |
# +----------------------------------------------------------+
"nvim" = { git = "catppuccin/nvim", rev = "v1.7.0" }
"nvim-web-devicons" = { version = "0.100" }
"tiny-devicons-auto-colors.nvim" = { git = "rachartier/tiny-devicons-auto-colors.nvim" }

# +----------------------------------------------------------+
# | Editor                                                   |
# +----------------------------------------------------------+
# +- Vim Built-in Enhancements ------------------------------+
"dial.nvim" = "0.4.0"
"mini.misc" = "0.9.0"
"vim-matchup" = { git = "andymass/vim-matchup", branch = "master" }       # Matchup
"nvim-hlslens" = { git = "kevinhwang91/nvim-hlslens" }                    # Search
"highlight-undo.nvim" = { git = "tzachar/highlight-undo.nvim" }           # Undo
"wrapping.nvim" = { git = "andrewferrier/wrapping.nvim", rev = "v1.2.0" } # Wrap
"yanky.nvim" = "scm"

# +- Visual Enhancements ------------------------------------+
"nvim-colorizer.lua" = "scm"
"vim-illuminate" = { git = "rrethy/vim-illuminate" } # Highlight Cursor Word
"indent-blankline.nvim" = "3.7.1"

# +- Vim Motions --------------------------------------------+
"nvim-surround" = { version = "scm", pin = true }
"flash.nvim" = "2.1.0"
"vim-repeat" = { git = "tpope/vim-repeat", rev = "v1.2^{}" } # Dot Repeat
"demicolon.nvim"= { git = "mawkler/demicolon.nvim", config = true } # Semicolon repeat

# +- Miscellenous -------------------------------------------+
"guess-indent.nvim" = "scm"
"vim-bbye" = { git = "moll/vim-bbye", rev = "v1.0.1" }
"treesj" = "scm"

# +----------------------------------------------------------+
# | Integrated Development Environment                       |
# +----------------------------------------------------------+

# +- Comments / Documentation -------------------------------+
"neogen" = "2.19.0"
"comment-box.nvim" = "scm"

# +- Completion ---------------------------------------------+
"nvim-cmp" = "scm"
"cmp-nvim-lsp-signature-help" = { git = "hrsh7th/cmp-nvim-lsp-signature-help" }
"cmp-nvim-lsp" = "scm"
"cmp-path" = "scm"
"cmp-cmdline" = "scm"
"cmp-buffer" = "scm"
"cmp-rg" = "1.3.9"
"cmp-dap" = { git = "rcarriga/cmp-dap" }
"lspkind.nvim" = "scm"
# Copilot
"copilot.vim" = { git = "github/copilot.vim", rev = "v1.38.0" }

# +- Debugging ----------------------------------------------+
"nvim-dap" = "0.8.0"
"nvim-dap-ui" = "4.0.0"
"nvim-dap-virtual-text" = "scm"
"goto-breakpoints.nvim" = { git = "ofirgall/goto-breakpoints.nvim" }
"persistent-breakpoints.nvim" = { git = "weissle/persistent-breakpoints.nvim" }
# +- Debugging: Adapters ------------------------------------+
"neotest-python" = { git = "nvim-neotest/neotest-python" }

# +- Git ----------------------------------------------------+
"git-conflict.nvim" = { git = "akinsho/git-conflict.nvim", rev = "v2.0.0" }
"gitsigns.nvim" = { git = "lewis6991/gitsigns.nvim", rev = "v0.9.0" }
"neogit" = { version = "scm", pin = true }
"diffview.nvim" = "scm"
"octo.nvim" = "scm"
"gitlab.nvim" = { git = "harrisoncramer/gitlab.nvim", rev = "v2.7.1" }

# +- Language Server Protocol -------------------------------+
"clear-action.nvim" = { git = "luckasRanarison/clear-action.nvim", rev = "v0.3.0" }
"glance.nvim" = "scm"
"hover.nvim" = "scm"
"lsp_signature.nvim" = "0.3.1"
"lsplinks.nvim" = { git = "icholy/lsplinks.nvim", rev = "v1.0.0" }
"refjump.nvim" = { git = "mawkler/refjump.nvim", config = { options = {} } } # Jump to reference with ]r and [r 
"workspace-diagnostics.nvim" = { git = "artemave/workspace-diagnostics.nvim" }

# +- Session and Project Management - -----------------------+
"possession.nvim" = { version = "scm" }
"workspaces.nvim" = { git = "natecraddock/workspaces.nvim", rev = "master" }

# +- Test ---------------------------------------------------+
"neotest" = "5.4.0"

# +- Tooling ------------------------------------------------+
"conform.nvim" = "7.0.0"
"nvim-lint" = "scm"
"nvim-rulebook" = { git = "chrisgrieser/nvim-rulebook" }

# +- Treesitter ---------------------------------------------+
"rocks-treesitter.nvim" = { version = "1.1.2" }
"nvim-treesitter-legacy-api" = "scm"
# +- Treesitter: Modules ------------------------------------+
"targets.vim" = { git = "wellle/targets.vim", rev = "v0.5.0^{}" }
"rainbow-delimiters.nvim" = "0.5.0"
"nvim-autopairs" = { version = "scm", config = "quitlox.plugins.ide.treesitter.autopairs" }
"nvim-ts-autotag" = { version = "scm" }
"nvim-ts-context-commentstring" = { version = "scm", config = "quitlox.plugins.ide.treesitter.context-commentstring" }
"nvim-treesitter-endwise" = { git = "RRethy/nvim-treesitter-endwise", config = "quitlox.plugins.ide.treesitter.endwise" }
"nvim-treesitter-textsubjects" = { git = "RRethy/nvim-treesitter-textsubjects", config = "quitlox.plugins.ide.treesitter.textsubjects" }
"nvim-treesitter-textobjects" = { version = "scm", config = "quitlox.plugins.ide.treesitter.textobjects" }
"nvim-various-textobjs" = { version = "scm", config = "quitlox.plugins.ide.treesitter.textobjects-extra" }

# +- Miscellenous -------------------------------------------+
"gitignore.nvim" = { git = "wintermute-cell/gitignore.nvim" }
"nvim-spectre" = "scm"

# +----------------------------------------------------------+
# | Language Support                                         |
# +----------------------------------------------------------+
"nvim-lspconfig" = "0.1.8"
"otter.nvim" = { version = "2.3.0", config = "quitlox.plugins.lang.otter" }
"nvim-parinfer" = "1.2.0"                                                   # parentheses support for lisp-like languages

# +- Config -------------------------------------------------+
"schemastore.nvim" = { version = "scm", config = "quitlox.plugins.lang.config-lang" }
# +- Go -----------------------------------------------------+
"go.nvim" = { version = "0.9.0", ft = [ "go", "gomod" ], config = "quitlox.plugins.lang.go" }
"guihua.lua" = { git = "ray-x/guihua.lua", rev = "v0.1^{}", ft = [ "go", "gomod" ] }
# +- HTTP ---------------------------------------------------+
"kulala.nvim" = { git = "mistweaverco/kulala.nvim", rev = "v2.6.0", config = "quitlox.plugins.lang.http" }
# +- LaTeX --------------------------------------------------+
"vimtex" = { git = "lervag/vimtex", rev = "v2.9" }
# +- Lua ----------------------------------------------------+
"lazydev.nvim" = { version = "1.8.0", config = "quitlox.plugins.lang.lua" }
"luvit-meta" = { git = "Bilal2453/luvit-meta" }
# +- Markdown -----------------------------------------------+
"markdown.nvim" = { git = "tadmccorkle/markdown.nvim", config = "quitlox.plugins.lang.markdown"}
"markdown-preview.nvim" = { git = "iamcco/markdown-preview.nvim", rev = "v0.0.9^{}", config = "quitlox.plugins.lang.markdown-preview" }
"markdown-render" = { git = "meanderingprogrammer/markdown.nvim", rev = "v4.1.0^{}", config = "quitlox.plugins.lang.markdown-render", ft = "markdown" }
# +- Python -------------------------------------------------+
"nvim-dap-python" = { version = "scm", config = "quitlox.plugins.lang.python-dap" }
"venv-selector.nvim" = { git = "linux-cultist/venv-selector.nvim", branch = "regexp", config = "quitlox.plugins.lang.python-venv" }
"pymple.nvim"= { git = "alexpasmantier/pymple.nvim", rev = "v0.1.0", config = true } # Update imports on file move, Code action for imports
# +- Rust ---------------------------------------------------+
"rustaceanvim" = { version = "5.1.0", config = "quitlox.plugins.lang.rust" }
# +- Vim ----------------------------------------------------+
"one-small-step-for-vimkind" = { version = "scm", config = "quitlox.plugins.lang.vim" }
# +- Web ----------------------------------------------------+
"typescript-tools.nvim" = { version = "scm", config = "quitlox.plugins.lang.typescript" }
"tailwind-tools.nvim" = { git = "luckasRanarison/tailwind-tools.nvim", rev = "v0.2.0", config = "quitlox.plugins.lang.tailwind" }

# +- Minor Languages ----------------------------------------+
"nvim-ansible" = { git = "mfussenegger/nvim-ansible" }
"vim-sage" = { git = "petRUShka/vim-sage" }
"yuck.vim" = { git = "elkowar/yuck.vim" }

# +----------------------------------------------------------+
# | Components                                               |
# +----------------------------------------------------------+

# +- Breadcrumbs --------------------------------------------+
"barbecue.nvim" = "scm"
"nvim-navic" = "scm"

# +- Bufferline ---------------------------------------------+
"bufferline.nvim" = "4.7.0"

# +- ChatGPT ------------------------------------------------+
"gp.nvim" = { git = "robitx/gp.nvim", rev = "v3.4.0" }

# +- File Explorer ------------------------------------------+
"neo-tree.nvim" = "3.26"
"nvim-window-picker" = { git = "s1n7ax/nvim-window-picker", rev = "v2.0.3" } # neo-tree.nvim
"nvim-lsp-file-operation" = { git = "antosha417/nvim-lsp-file-operations" }
"oil.nvim" = "2.11.0"

# +- Finder -------------------------------------------------+
# Telescope
"telescope.nvim" = { git = "nvim-telescope/telescope.nvim", pin = true }
"telescope-fzf-native.nvim" = { git = "nvim-telescope/telescope-fzf-native.nvim", build = "make" }
"smart-open.nvim" = "scm"
"telescope-helpgrep.nvim" = { git = "catgoose/telescope-helpgrep.nvim" }
# Keymaps
"which-key.nvim" = "3.13.2"
# Commands
"legendary.nvim" = "2.13.11"
# Buffers
"arrow.nvim" = { git = "otavioschwanck/arrow.nvim" }

# +- Notifications ------------------------------------------+
"nvim-notify" = "3.13.5"
"fidget.nvim" = "1.4.1"

# +- REPL ---------------------------------------------------+
"molten-nvim" = { git = "benlubas/molten-nvim", rev = "v1.8.4" }

# +- Runner (Overseer) --------------------------------------+
"overseer.nvim" = "1.4.0"

# +- Statusline (Lualine) -----------------------------------+
"lualine.nvim" = "scm"
"lualine-pretty-path" = { git = "bwpge/lualine-pretty-path" }

# +- Terminal (toggleterm) ----------------------------------+
"toggleterm.nvim" = "2.12.0"

# +- Quickfix -----------------------------------------------+
"trouble.nvim" = "3.6.0"

# +- Miscelleneous ------------------------------------------+
"edgy.nvim" = "1.10.2"
"dressing.nvim" = "2.2.2"
"icon-picker.nvim" = "scm"
"todo-comments.nvim" = "1.3.0"

# +----------------------------------------------------------+
# | Dependencies                                             |
# +----------------------------------------------------------+
"promise-async" = "scm"
"nui.nvim" = "0.3.0"
"sqlite.lua" = "1.2.2"
"nvim-nio" = { git = "nvim-neotest/nvim-nio" } # TODO: switch back to >1.10.0
"fixcursorhold.nvim" = { git = "antoinemadec/FixCursorHold.nvim" }
"image.nvim" = "1.3.0"
"plenary.nvim" = { git = "nvim-lua/plenary.nvim", rev = "a3e3bc8", pin = true } # pin required as scm is way behind

# +----------------------------------------------------------+
# | New and Unsorted                                         |
# +----------------------------------------------------------+
"profile.nvim" = { git = "stevearc/profile.nvim" }
"perfanno.nvim" = { git = "t-troebst/perfanno.nvim" }

# +- Treesitter: Parsers ------------------------------------+
tree-sitter-bash = "scm"
tree-sitter-c = "scm"
tree-sitter-css = "scm"
tree-sitter-dockerfile = "scm"
tree-sitter-ecma = "scm"
tree-sitter-editorconfig = "scm"
tree-sitter-gitcommit = "scm"
tree-sitter-gitignore = "scm"
tree-sitter-git_config = "scm"
tree-sitter-git_rebase = "scm"
tree-sitter-html = "scm"
tree-sitter-htmldjango = "scm"
tree-sitter-html_tags = "scm"
tree-sitter-http = "scm"
tree-sitter-hyprlang = "scm"
tree-sitter-ini = "scm"
tree-sitter-javascript = "scm"
tree-sitter-json = "scm"
tree-sitter-jsonc = "scm"
tree-sitter-jsx = "scm"
tree-sitter-jq = "scm"
tree-sitter-latex = "scm"
tree-sitter-lua = "scm"
tree-sitter-luadoc = "scm"
tree-sitter-markdown = "scm"
tree-sitter-markdown_inline = "scm"
tree-sitter-perl = "scm"
tree-sitter-python = "scm"
tree-sitter-query = "scm"
tree-sitter-requirements = "scm"
tree-sitter-rst = "scm"
tree-sitter-scss = "scm"
tree-sitter-svelte = "scm"
tree-sitter-tsx = "scm"
tree-sitter-toml = "scm"
tree-sitter-typescript = "scm"
tree-sitter-xml = "scm"
tree-sitter-vim = "scm"
tree-sitter-vimdoc = "scm"
tree-sitter-yaml = "scm"
tree-sitter-yuck = "scm"

# +----------------------------------------------------------+
# | Bundles                                                  |
# +----------------------------------------------------------+

[bundles.editor]
items = [
  "dial.nvim",
  "mini.misc",
  "vim-matchup",
  "highlight-undo.nvim",
  "wrapping.nvim",
  "yanky.nvim",
  "nvim-colorizer.lua",
  "vim-illuminate",
  "indent-blankline.nvim",
  "nvim-surround",
  "flash.nvim",
  "vim-repeat",
  "guess-indent.nvim",
  "vim-bbye",
  "treesj",
]
config = "quitlox.plugins.editor"

# +- Integrated Developer Environment -----------------------+
[bundles.cmp]
items = [
  "nvim-cmp",
  "cmp-nvim-lsp-signature-help",
  "cmp-path",
  "cmp-cmdline",
  "cmp-buffer",
  "cmp-rg",
  "lspkind.nvim",
]
config = "quitlox.plugins.ide.cmp"

[bundles.dap]
items = [
  "nvim-dap-ui",
  "nvim-dap-virtual-text",
  "goto-breakpoints.nvim",
  "persistent-breakpoints.nvim",
  # Adapters
  "neotest-python",
]
config = "quitlox.plugins.ide.dap"

[bundles.lsp]
items = [
  "clear-action.nvim",
  "glance.nvim",
  "hover.nvim",
  "lsp_signature.nvim",
  "lsplinks.nvim",
  "workspace-diagnostics.nvim",
]
config = "quitlox.plugins.ide.lsp"

# +- Components ---------------------------------------------+
[bundles.telescope]
items = [
  "telescope.nvim",
  "telescope-fzf-native.nvim",
  "smart-open.nvim",
  "telescope-helpgrep.nvim",
]
config = "quitlox.plugins.telescope"

# +----------------------------------------------------------+
# | Config                                                   |
# +----------------------------------------------------------+

[config]
plugins_dir = "quitlox/plugins/"
auto_setup = false

[dev]
dir = "~/Workspace/neovim-plugins"

# +----------------------------------------------------------+
# | Graveyard                                                |
# +----------------------------------------------------------+
# "marks.nvim" = { git = "chentoast/marks.nvim" }
