[rocks]

[plugins]
"rocks.nvim" = "2.41.2"
"rocks-git.nvim" = "2.5.1"
"rocks-config.nvim" = "3.0.0"
"rocks-lazy.nvim" = "1.1.1"
"rocks-dev.nvim" = "1.7.0"

# +----------------------------------------------------------+
# | Colorschemes                                             |
# +----------------------------------------------------------+
"nvim"= { git = "catppuccin/nvim", rev = "v1.9.0" }
"nvim-web-devicons" = { version = "0.100" }
"tiny-devicons-auto-colors.nvim" = { git = "rachartier/tiny-devicons-auto-colors.nvim", rev = "a39fa4c92268832f6034306793b8acbfec2a7549" }

# +----------------------------------------------------------+
# | Editor                                                   |
# +----------------------------------------------------------+
# +- Vim Built-in Enhancements ------------------------------+
"dial.nvim" = "0.4.0"
"mini.misc" = "0.9.0"
"vim-matchup" = { git = "andymass/vim-matchup", rev = "v0.7.3", branch = "master" }
"nvim-hlslens" = { git = "kevinhwang91/nvim-hlslens", rev = "v1.0.0" }
"highlight-undo.nvim"  = { git = "tzachar/highlight-undo.nvim", rev = "c87a6ec1ded241ef223269077cbd5f97a6f0d5bf" }
"wrapping.nvim" = { git = "andrewferrier/wrapping.nvim", rev = "v1.2.0" } # Wrap
"yanky.nvim" = "scm"

# +- Visual Enhancements ------------------------------------+
"nvim-colorizer.lua" = "scm"
"indent-blankline.nvim" = "3.8.3"
"vim-illuminate" = { git = "rrethy/vim-illuminate", rev = "5eeb7951fc630682c322e88a9bbdae5c224ff0aa" }

# +- Vim Motions --------------------------------------------+
"nvim-surround" = { version = "2.1.5", pin = true }
"flash.nvim" = "2.1.0"
"vim-repeat"  = { git = "tpope/vim-repeat", rev = "v1.2" }

# +- Miscellenous -------------------------------------------+
"guess-indent.nvim" = "scm"
"vim-bbye" = { git = "moll/vim-bbye", rev = "v1.0.1" }
"treesj" = "scm"

# +----------------------------------------------------------+
# | Integrated Development Environment                       |
# +----------------------------------------------------------+

# +- Comments / Documentation -------------------------------+
"neogen" = "2.19.4"
"comment-box.nvim" = "scm"

# +- Completion ---------------------------------------------+
"nvim-cmp" = "scm"
"cmp-nvim-lsp-signature-help" = { git = "hrsh7th/cmp-nvim-lsp-signature-help", rev = "031e6ba70b0ad5eee49fd2120ff7a2e325b17fa7" }
"cmp-nvim-lsp" = "scm"
"cmp-path" = "scm"
"cmp-cmdline" = "scm"
"cmp-buffer" = "scm"
"cmp-rg" = "1.3.9"
"cmp-dap" = { git = "rcarriga/cmp-dap", rev = "ea92773e84c0ad3288c3bc5e452ac91559669087" }
"lspkind.nvim" = "scm"
# Copilot
"copilot.vim" = { git = "github/copilot.vim", rev = "v1.38.0" }

# +- Debugging ----------------------------------------------+
"nvim-dap" = "scm"
"nvim-dap-ui" = "4.0.0"
"nvim-dap-virtual-text" = "scm"
"goto-breakpoints.nvim" = { git = "ofirgall/goto-breakpoints.nvim", rev = "d14776899eda4023667b246e5c53c14a7c41f88e" }

# +- Git ----------------------------------------------------+
"git-conflict.nvim" = { git = "akinsho/git-conflict.nvim", rev = "v2.0.0" }
"gitsigns.nvim" = { git = "lewis6991/gitsigns.nvim", rev = "v0.9.0" }
"neogit" = { version = "scm" }
"diffview.nvim" = "scm"
"gitlab.nvim" = { git = "harrisoncramer/gitlab.nvim", rev = "v3.3.8" }
"octo.nvim" = "scm"

# +- Language Server Protocol -------------------------------+
"glance.nvim" = "scm"
"hover.nvim" = "scm"
"lsp_signature.nvim" = "0.3.1"
"lsplinks.nvim" = { git = "icholy/lsplinks.nvim", rev = "v1.0.0" }
"workspace-diagnostics.nvim" = { git = "artemave/workspace-diagnostics.nvim", rev = "573ff93c47898967efdfbc6587a1a39e3c2d365e" }

# +- Session and Project Management - -----------------------+
"possession.nvim" = { version = "scm" }
"workspaces.nvim" = { git = "natecraddock/workspaces.nvim", rev = "master" }

# +- Test ---------------------------------------------------+
"neotest" = "5.6.1"

# +- Tooling ------------------------------------------------+
"conform.nvim" = "8.1.0"
"nvim-lint" = "scm"
"nvim-rulebook" = { git = "chrisgrieser/nvim-rulebook", rev = "bc5e3874a9870709ec91152f9efce6dad49ca862" }

# +- Treesitter ---------------------------------------------+
"rocks-treesitter.nvim" = { version = "1.1.3" }
"nvim-treesitter-legacy-api" = "scm"
# +- Treesitter: Modules ------------------------------------+
"targets.vim" = { git = "wellle/targets.vim", rev = "v0.5.0" }
"rainbow-delimiters.nvim" = "0.7.0"
"nvim-autopairs" = { version = "scm", config = "quitlox.plugins.ide.treesitter.autopairs" }
"nvim-ts-autotag" = { version = "scm" }
"nvim-ts-context-commentstring" = { version = "scm", config = "quitlox.plugins.ide.treesitter.context-commentstring" }
"nvim-treesitter-endwise" = { git = "RRethy/nvim-treesitter-endwise", rev = "8b34305ffc28bd75a22f5a0a9928ee726a85c9a6" }
"nvim-treesitter-textsubjects" = { git = "RRethy/nvim-treesitter-textsubjects", rev = "a8d2844bba925d9450ef7ab215f3b054028288ca" }
"nvim-treesitter-textobjects" = { version = "scm", config = "quitlox.plugins.ide.treesitter.textobjects" }
"nvim-various-textobjs" = { version = "scm", config = "quitlox.plugins.ide.treesitter.textobjects-extra" }
"nvim-spectre" = "scm"

# +- Miscellenous -------------------------------------------+
"gitignore.nvim"= { git = "wintermute-cell/gitignore.nvim", rev = "2455191ec94da8ed222806a4fe3aa358eac1e558" }

# +----------------------------------------------------------+
# | Language Support                                         |
# +----------------------------------------------------------+
"nvim-lspconfig" = "1.0.0"
"otter.nvim" = { version = "2.5.0", config = "quitlox.plugins.lang.otter" }
"nvim-parinfer" = "1.2.0"

# +- Config -------------------------------------------------+
"schemastore.nvim" = { version = "scm", config = "quitlox.plugins.lang.config-lang" }
# +- Go -----------------------------------------------------+
"go.nvim" = { version = "0.9.0", ft = [ "go", "gomod" ], config = "quitlox.plugins.lang.go" }
"guihua.lua" = { git = "ray-x/guihua.lua", rev = "v0.1^{}", ft = [ "go", "gomod" ] }
# +- HTTP ---------------------------------------------------+
<<<<<<< HEAD
"kulala.nvim"= { git = "mistweaverco/kulala.nvim", rev = "v4.4.1" }
=======
"kulala.nvim" = { git = "mistweaverco/kulala.nvim", rev = "v4.4.0" }
>>>>>>> 9c24e4f ([nvim] remove redundant persistent-breakpoints plugin)
# +- LaTeX --------------------------------------------------+
"vimtex" = { git = "lervag/vimtex", rev = "v2.9" }
# +- Lua ----------------------------------------------------+
"lazydev.nvim" = { version = "1.8.0", config = "quitlox.plugins.lang.lua" }
"luvit-meta" = { git = "Bilal2453/luvit-meta", rev = "ce76f6f6cdc9201523a5875a4471dcfe0186eb60" }
# +- Markdown -----------------------------------------------+
"markdown.nvim"= { git = "tadmccorkle/markdown.nvim", rev = "dfa0d2def6dbf77e9206b16dc90cad4dd23d55d2" }
"markdown-render"  = { git = "meanderingprogrammer/markdown.nvim", rev = "v7.5.0" }
"vivify.vim" = { git = "jannis-baum/vivify.vim", rev = "18ba8b46f4cbe6c49c5de0e47cdc51bee1513aa3" }
"table-nvim" = { git = "scjangra/table-nvim", rev = "c044fd37169eb10376962b0d0cec5f94d58ca626", ft = "markdown" }
# +- Python -------------------------------------------------+
"neotest-python" = { git = "nvim-neotest/neotest-python", rev = "a2861ab3c9a0bf75a56b11835c2bfc8270f5be7e" }
"nvim-dap-python" = { version = "scm", config = "quitlox.plugins.lang.python-dap" }
"pymple.nvim"= { git = "alexpasmantier/pymple.nvim", rev = "v0.4.0" }
"venv-selector.nvim" = { git = "linux-cultist/venv-selector.nvim", rev = "0.4", branch = "regexp" }
# +- Rust ---------------------------------------------------+
"rustaceanvim" = { version = "5.13.1", config = "quitlox.plugins.lang.rust" }
# +- Vim ----------------------------------------------------+
"one-small-step-for-vimkind" = { version = "scm", config = "quitlox.plugins.lang.vim" }
# +- Web ----------------------------------------------------+
"typescript-tools.nvim" = { version = "scm", config = "quitlox.plugins.lang.typescript" }
"tailwind-tools.nvim" = { git = "luckasRanarison/tailwind-tools.nvim", rev = "v0.3.1" }
# +- Minor Languages ----------------------------------------+
"nvim-ansible"  = { git = "mfussenegger/nvim-ansible", rev = "44dabdaa8a9193b7f564a8408ed6d7107705030a" }
"vim-sage" = { git = "petRUShka/vim-sage", rev = "4b036eead948e3ae1d414efdeefe11f7543fc366" }
"yuck.vim" = { git = "elkowar/yuck.vim", rev = "9b5e0370f70cc30383e1dabd6c215475915fe5c3" }

# +----------------------------------------------------------+
# | Components                                               |
# +----------------------------------------------------------+

# +- Breadcrumbs --------------------------------------------+
"barbecue.nvim" = "scm"
"nvim-navic" = "scm"

# +- Bufferline ---------------------------------------------+
"bufferline.nvim" = "4.8.0"

# +- ChatGPT ------------------------------------------------+
"gp.nvim" = { git = "robitx/gp.nvim", rev = "v3.9.0" }

# +- File Explorer ------------------------------------------+
"neo-tree.nvim" = "3.26"
"nvim-window-picker" = { git = "s1n7ax/nvim-window-picker", rev = "v2.0.3" } # neo-tree.nvim
"nvim-lsp-file-operation"  = { git = "antosha417/nvim-lsp-file-operations", rev = "9744b738183a5adca0f916527922078a965515ed" }
"oil.nvim" = "2.12.2"

# +- Finder -------------------------------------------------+
# Telescope
"telescope.nvim" = "scm"
"telescope-fzf-native.nvim" = { git = "nvim-telescope/telescope-fzf-native.nvim", rev = "cf48d4dfce44e0b9a2e19a008d6ec6ea6f01a83b", build = "make" }
"telescope-helpgrep.nvim" = { git = "catgoose/telescope-helpgrep.nvim", rev = "641b2f1b4559a67731dc42fd84203817ebd6e2ce" }
"smart-open.nvim" = "scm"
# Keymaps
"which-key.nvim" = "3.13.3"
# Commands
"legendary.nvim" = "2.13.11"
# Buffers
"arrow.nvim"  = { git = "otavioschwanck/arrow.nvim", rev = "5438c977e729a29d96bd54c8da3103154e80dbd1" }

# +- Notifications ------------------------------------------+
"nvim-notify" = "3.14.0"
"fidget.nvim" = "1.4.1"

# +- REPL ---------------------------------------------------+
"molten-nvim" = { git = "benlubas/molten-nvim", rev = "v1.9.0" }

# +- Runner (Overseer) --------------------------------------+
"overseer.nvim" = "1.4.0"

# +- Statusline (Lualine) -----------------------------------+
"lualine.nvim" = "scm"
"lualine-pretty-path"  = { git = "bwpge/lualine-pretty-path", rev = "852cb06f3562bced4776a924e56a9e44d0ce634f" }

# +- Terminal (toggleterm) ----------------------------------+
"toggleterm.nvim" = "2.12.0"

# +- Quickfix -----------------------------------------------+
"trouble.nvim" = "3.6.0"

# +- Miscelleneous ------------------------------------------+
"edgy.nvim" = "1.10.2"
"dressing.nvim" = "3.0.0"
"icon-picker.nvim" = "scm"
"todo-comments.nvim" = "1.4.0"

# +----------------------------------------------------------+
# | Dependencies                                             |
# +----------------------------------------------------------+
"promise-async" = "scm"
"nui.nvim" = "0.3.0"
"sqlite.lua" = "scm"
"nvim-nio" = "1.10.0"
"fixcursorhold.nvim" = { git = "antoinemadec/FixCursorHold.nvim", rev = "1900f89dc17c603eec29960f57c00bd9ae696495" }
"image.nvim" = "1.3.0"
"plenary.nvim" = "scm"

# +- Treesitter: Parsers ------------------------------------+
tree-sitter-bash = "scm"
tree-sitter-bibtex = "0.0.29"
tree-sitter-c = "scm"
tree-sitter-cpp = "0.0.32"
tree-sitter-css = "scm"
tree-sitter-dockerfile = "scm"
tree-sitter-ecma = "scm"
tree-sitter-editorconfig = "scm"
tree-sitter-gitcommit = "scm"
tree-sitter-gitignore = "scm"
tree-sitter-git_config = "scm"
tree-sitter-git_rebase = "scm"
tree-sitter-html = "scm"
tree-sitter-htmldjango = "scm"
tree-sitter-html_tags = "scm"
tree-sitter-http = "scm"
tree-sitter-hyprlang = "scm"
tree-sitter-ini = "scm"
tree-sitter-javascript = "scm"
tree-sitter-json = "scm"
tree-sitter-jsonc = "scm"
tree-sitter-jsx = "scm"
tree-sitter-jq = "scm"
tree-sitter-latex = "scm"
tree-sitter-lua = "scm"
tree-sitter-luadoc = "scm"
tree-sitter-markdown = "scm"
tree-sitter-markdown_inline = "scm"
tree-sitter-perl = "scm"
tree-sitter-python = "scm"
tree-sitter-query = "scm"
tree-sitter-requirements = "scm"
tree-sitter-rst = "scm"
tree-sitter-scss = "scm"
tree-sitter-svelte = "scm"
tree-sitter-tsx = "scm"
tree-sitter-toml = "scm"
tree-sitter-typescript = "scm"
tree-sitter-xml = "scm"
tree-sitter-vim = "scm"
tree-sitter-vimdoc = "scm"
tree-sitter-vue = "0.0.29"
tree-sitter-yaml = "scm"
tree-sitter-yuck = "scm"

# +----------------------------------------------------------+
# | New and Unsorted                                         |
# +----------------------------------------------------------+
"profile.nvim" = { git = "stevearc/profile.nvim", rev = "0ee32b7aba31d84b0ca76aaff2ffcb11f8f5449f" }
"perfanno.nvim" = { git = "t-troebst/perfanno.nvim", rev = "b138718bf4289b429dc81cadaf80ace8221c647b" }

# +----------------------------------------------------------+
# | Bundles                                                  |
# +----------------------------------------------------------+

[bundles.editor]
items = [
  "dial.nvim",
  "mini.misc",
  "vim-matchup",
  "highlight-undo.nvim",
  "wrapping.nvim",
  "yanky.nvim",
  "nvim-colorizer.lua",
  "vim-illuminate",
  "indent-blankline.nvim",
  "nvim-surround",
  "flash.nvim",
  "vim-repeat",
  "guess-indent.nvim",
  "vim-bbye",
  "treesj",
]
config = "quitlox.plugins.editor"

# +- Integrated Developer Environment -----------------------+
[bundles.cmp]
items = [
  "nvim-cmp",
  "cmp-nvim-lsp-signature-help",
  "cmp-path",
  "cmp-cmdline",
  "cmp-buffer",
  "cmp-rg",
  "lspkind.nvim",
]
config = "quitlox.plugins.ide.cmp"

[bundles.dap]
items = [
  "nvim-dap-ui",
  "nvim-dap-virtual-text",
  "goto-breakpoints.nvim",
  # Adapters
  "neotest-python",
]
config = "quitlox.plugins.ide.dap"

[bundles.lsp]
items = [
  "glance.nvim",
  "hover.nvim",
  "lsp_signature.nvim",
  "lsplinks.nvim",
  "workspace-diagnostics.nvim",
]
config = "quitlox.plugins.ide.lsp"

# +- Components ---------------------------------------------+
[bundles.telescope]
items = [
  "telescope.nvim",
  "telescope-fzf-native.nvim",
  "smart-open.nvim",
  "telescope-helpgrep.nvim",
]
config = "quitlox.plugins.telescope"

# +----------------------------------------------------------+
# | Config                                                   |
# +----------------------------------------------------------+

[config]
plugins_dir = "quitlox/plugins/"
auto_setup = false

[dev]
dir = "~/Workspace/neovim-plugins"

# +----------------------------------------------------------+
# | Graveyard                                                |
# +----------------------------------------------------------+
# "marks.nvim" = { git = "chentoast/marks.nvim" }
# "clear-action.nvim" = { git = "luckasRanarison/clear-action.nvim", rev = "v0.3.0" }
